{"/":{"title":"About","data":{"":"Hey there! I'm Donald33 Wang and a self-taught hacker.Check my GitHub or Twitter."}},"/posts":{"title":"Thoughts","data":{"":""}},"/posts/fork-and-printf":{"title":"fork and printf","data":{"":"fork() is non-deterministic, and sometime this can be a real problem. To solve this kind of problem, you may need to rely on your previous experience.One day when experimenting on fork(), I got a strange print message:\nint main() {}\nI was surprised and could not figure out why for a while. Since I am using CLion and WSL 2, I soon realized that maybe it was the fault of CLion. So I ran the executable myself. A different print message came to my eyes.No wonder.After a long time of thinking, I related to procedures of how shells work. When you type in a command and hit enter, the shell program first creates a process to run that command. The control soon returns to the shell after the command program is finished. However, if the command program creates a subprocess, and the subprocess is still running even if the main process has already returned, this can happen.In order to check my assumption, I decided to wait() for the child process to finish. And this time it worked perfectly.Be careful of the environment you are using. Search the database in your brain."}},"/posts/the-road-not-taken":{"title":"The Road Not Taken","data":{"":"— BY ROBERT FROSTTwo roads diverged in a yellow wood,\nAnd sorry I could not travel both\nAnd be one traveler, long I stood\nAnd looked down one as far as I could\nTo where it bent in the undergrowth;Then took the other, as just as fair,\nAnd having perhaps the better claim,\nBecause it was grassy and wanted wear;\nThough as for that the passing there\nHad worn them really about the same,And both that morning equally lay\nIn leaves no step had trodden black.\nOh, I kept the first for another day!\nYet knowing how way leads on to way,\nI doubted if I should ever come back.I shall be telling this with a sigh\nSomewhere ages and ages hence:\nTwo roads diverged in a wood, and I—\nI took the one less traveled by,\nAnd that has made all the difference."}},"/posts/hello-world":{"title":"Hello World","data":{"":"Guess who's back, back again?Donald33 Wang is back, tell a friend.This is my first post on my new blog! How exciting! I never thought it could happen, but here we are!I'm sure I'll write a lot more interesting things in the future. Oh, sometimes I retweet random stuff on the Retweets\npage, check it out if you are curious~"}},"/posts/the-raven":{"title":"The Raven","data":{"":"— BY EDGAR ALLAN POEOnce upon a midnight dreary, while I pondered, weak and weary,\nOver many a quaint and curious volume of forgotten lore—\nWhile I nodded, nearly napping, suddenly there came a tapping,\nAs of some one gently rapping, rapping at my chamber door.\n“’Tis some visitor,” I muttered, “tapping at my chamber door—\nOnly this and nothing more.”Ah, distinctly I remember it was in the bleak December;\nAnd each separate dying ember wrought its ghost upon the floor.\nEagerly I wished the morrow;—vainly I had sought to borrow\nFrom my books surcease of sorrow—sorrow for the lost Lenore—\nFor the rare and radiant maiden whom the angels name Lenore—\nNameless here for evermore.And the silken, sad, uncertain rustling of each purple curtain\nThrilled me—filled me with fantastic terrors never felt before;\nSo that now, to still the beating of my heart, I stood repeating\n“’Tis some visitor entreating entrance at my chamber door—\nSome late visitor entreating entrance at my chamber door;—\nThis it is and nothing more.”Presently my soul grew stronger; hesitating then no longer,\n“Sir,” said I, “or Madam, truly your forgiveness I implore;\nBut the fact is I was napping, and so gently you came rapping,\nAnd so faintly you came tapping, tapping at my chamber door,\nThat I scarce was sure I heard you”—here I opened wide the door;—\nDarkness there and nothing more.Deep into that darkness peering, long I stood there wondering, fearing,\nDoubting, dreaming dreams no mortal ever dared to dream before;\nBut the silence was unbroken, and the stillness gave no token,\nAnd the only word there spoken was the whispered word, “Lenore?”\nThis I whispered, and an echo murmured back the word, “Lenore!”—\nMerely this and nothing more.Back into the chamber turning, all my soul within me burning,\nSoon again I heard a tapping somewhat louder than before.\n“Surely,” said I, “surely that is something at my window lattice;\nLet me see, then, what thereat is, and this mystery explore—\nLet my heart be still a moment and this mystery explore;—\n’Tis the wind and nothing more!”Open here I flung the shutter, when, with many a flirt and flutter,\nIn there stepped a stately Raven of the saintly days of yore;\nNot the least obeisance made he; not a minute stopped or stayed he;\nBut, with mien of lord or lady, perched above my chamber door—\nPerched upon a bust of Pallas just above my chamber door—\nPerched, and sat, and nothing more.Then this ebony bird beguiling my sad fancy into smiling,\nBy the grave and stern decorum of the countenance it wore,\n“Though thy crest be shorn and shaven, thou,” I said, “art sure no craven,\nGhastly grim and ancient Raven wandering from the Nightly shore—\nTell me what thy lordly name is on the Night’s Plutonian shore!”\nQuoth the Raven “Nevermore.”Much I marvelled this ungainly fowl to hear discourse so plainly,\nThough its answer little meaning—little relevancy bore;\nFor we cannot help agreeing that no living human being\nEver yet was blessed with seeing bird above his chamber door—\nBird or beast upon the sculptured bust above his chamber door,\nWith such name as “Nevermore.”But the Raven, sitting lonely on the placid bust, spoke only\nThat one word, as if his soul in that one word he did outpour.\nNothing farther then he uttered—not a feather then he fluttered—\nTill I scarcely more than muttered “Other friends have flown before—\nOn the morrow he will leave me, as my Hopes have flown before.”\nThen the bird said “Nevermore.”Startled at the stillness broken by reply so aptly spoken,\n“Doubtless,” said I, “what it utters is its only stock and store\nCaught from some unhappy master whom unmerciful Disaster\nFollowed fast and followed faster till his songs one burden bore—\nTill the dirges of his Hope that melancholy burden bore\nOf ‘Never—nevermore’.”But the Raven still beguiling all my fancy into smiling,\nStraight I wheeled a cushioned seat in front of bird, and bust and door;\nThen, upon the velvet sinking, I betook myself to linking\nFancy unto fancy, thinking what this ominous bird of yore—\nWhat this grim, ungainly, ghastly, gaunt, and ominous bird of yore\nMeant in croaking “Nevermore.”This I sat engaged in guessing, but no syllable expressing\nTo the fowl whose fiery eyes now burned into my bosom’s core;\nThis and more I sat divining, with my head at ease reclining\nOn the cushion’s velvet lining that the lamp-light gloated o’er,\nBut whose velvet-violet lining with the lamp-light gloating o’er,\nShe shall press, ah, nevermore!Then, methought, the air grew denser, perfumed from an unseen censer\nSwung by Seraphim whose foot-falls tinkled on the tufted floor.\n“Wretch,” I cried, “thy God hath lent thee—by these angels he hath sent thee\nRespite—respite and nepenthe from thy memories of Lenore;\nQuaff, oh quaff this kind nepenthe and forget this lost Lenore!”\nQuoth the Raven “Nevermore.”“Prophet!” said I, “thing of evil!—prophet still, if bird or devil!—\nWhether Tempter sent, or whether tempest tossed thee here ashore,\nDesolate yet all undaunted, on this desert land enchanted—\nOn this home by Horror haunted—tell me truly, I implore—\nIs there—is there balm in Gilead?—tell me—tell me, I implore!”\nQuoth the Raven “Nevermore.”“Prophet!” said I, “thing of evil!—prophet still, if bird or devil!\nBy that Heaven that bends above us—by that God we both adore—\nTell this soul with sorrow laden if, within the distant Aidenn,\nIt shall clasp a sainted maiden whom the angels name Lenore—\nClasp a rare and radiant maiden whom the angels name Lenore.”\nQuoth the Raven “Nevermore.”“Be that word our sign of parting, bird or fiend!” I shrieked, upstarting—\n“Get thee back into the tempest and the Night’s Plutonian shore!\nLeave no black plume as a token of that lie thy soul hath spoken!\nLeave my loneliness unbroken!—quit the bust above my door!\nTake thy beak from out my heart, and take thy form from off my door!”\nQuoth the Raven “Nevermore.”And the Raven, never flitting, still is sitting, still is sitting\nOn the pallid bust of Pallas just above my chamber door;\nAnd his eyes have all the seeming of a demon’s that is dreaming,\nAnd the lamp-light o’er him streaming throws his shadow on the floor;\nAnd my soul from out that shadow that lies floating on the floor\nShall be lifted—nevermore!"}},"/posts/twenty-lessons":{"title":"Twenty Lessons on Fighting Tyranny from the Twentieth Century","data":{"":"— By Timothy Snyder at Yale UniversityAmericans are no wiser than the Europeans who saw democracy yield to fascism, Nazism or communism. Our one advantage is\nthat we might learn from their experience. Now is a good time to do so. From across the fearful twentieth century, here\nare twenty lessons about what it takes to oppose tyranny, adapted to the circumstances of today.1. Do not obey in advance. Most of the power of authoritarianism is freely given. In times like these, individuals\nthink ahead about what a more repressive government will want, and then offer themselves without being asked. A citizen\nwho adapts in this way is teaching power what it can do.2. Defend institutions. It is institutions that help us to preserve decency. They need our help as well. Do not speak\nof “our institutions” unless you make them yours by acting on their behalf. Institutions do not protect themselves. So\nchoose an institution you care about and take its side.3. Beware the one-party state. The parties that remade states and suppressed rivals were not omnipotent from the\nstart. They exploited a historic moment to make political life impossible for their opponents. So support the\nmulti-party system and defend the rules of democratic elections.4. Take responsibility for the face of the world. The symbols of today enable the reality of tomorrow. Notice the\nswastikas and other signs of hate. Do not look away, and do not get used to them. Remove them yourself and set an\nexample for others to do so.5. Remember professional ethics. When political leaders set a negative example, professional commitments to just\npractice become important. It is hard to subvert a rule-of-law state without lawyers, or to hold show trials without\njudges. Authoritarians need obedient civil servants, and concentration camp directors seek businessmen interested in\ncheap labor.6. Be wary of paramilitaries. When the men with guns who have always claimed to be against the system start wearing\nuniforms and marching around with torches and pictures of a Leader, the end is nigh. When the pro-leader paramilitary\nand the official police and military intermingle, the end has come.7. Be reflective if you must be armed. If you carry a weapon in public service, God bless you and keep you. But know\nthat evils of the past involved policemen and soldiers finding themselves, one day, doing irregular things. Be ready to\nsay no.8. Stand out. Someone has to. It is easy to follow along. It can feel strange to do or say something different. But\nwithout that unease, there is no freedom. Remember Rosa Parks. The moment you set an example, the spell of the status\nquo is broken, and others will follow.9. Be kind to our language. Avoid pronouncing the phrases everyone else does. Think up your own way of speaking, even\nif only to convey that thing you think everyone is saying. Make an effort to separate yourself from the internet. Read\nbooks.10. Believe in truth. To abandon facts is to abandon freedom. If nothing is true, then no one can criticize power\nbecause there is no basis upon which to do so. If nothing is true, then all is spectacle. The biggest wallet pays for\nthe most blinding lights.11. Investigate. Figure things out for yourself. Spend more time with long articles. Subsidize investigative\njournalism by subscribing to print media. Realize that some of what is on the internet is there to harm you. Learn about\nsites that investigate propaganda campaigns (some of which come from abroad). Take responsibility for what you\ncommunicate to others.12. Make eye contact and small talk. This is not just polite. It is part of being a citizen and a responsible member\nof society. It is also a way to stay in touch with your surroundings, break down social barriers, and understand whom\nyou should and should not trust. If we enter a culture of denunciation, you will want to know the psychological\nlandscape of your daily life.13. Practice corporeal politics. Power wants your body softening in your chair and your emotions dissipating on the\nscreen. Get outside. Put your body in unfamiliar places with unfamiliar people. Make new friends and march with them.14. Establish a private life. Nastier rulers will use what they know about you to push you around. Scrub your computer\nof malware. Remember that email is skywriting. Consider using alternative forms of the Internet, or simply using it\nless. Have personal exchanges in person. For the same reason, resolve any legal trouble.15. Contribute to good causes. Be active in organizations, political or not, that express your own view of life. Pick\na charity or two and set up autopay.16. Learn from peers in other countries. Keep up your friendships abroad, or make new friends abroad. The present\ndifficulties in the United States are an element of a larger trend. And no country is going to find a solution by\nitself. Make sure you and your family have passports.17. Listen for dangerous words. Be alert to the use of the words extremism and terrorism. Be alive to the fatal\nnotions of emergency and exception. Be angry about the treacherous use of patriotic vocabulary.18. Be calm when the unthinkable arrives. Modern tyranny is terror management. When the terrorist attack comes,\nremember that authoritarians exploit such events in order to consolidate power. Do not fall for it.19. Be a patriot. Set a good example of what America means for the generations to come.20. Be as courageous as you can. If none of us is prepared to die for freedom, then all of us will die under tyranny."}},"/tags/[tag]":{"title":"[tag]","data":{"":""}}}